import { Heading1, Link1 } from '../../../componentz/TextComponents';
//<h1 id="#reas" class="mb-4 text-1xl font-extrabold leading-none tracking-tight text-gray-900 md:text-1xl lg:text-1xl dark:text-white">{children} <span class="text-blue-600 dark:text-blue-500">(ИР)</span>?</h1>

export default function Page() {
  return (
    <main className="flex min-h-screen flex-col items-center">
      <div className=" justify-between p-8 max-w-5xl justify-center">
        <Heading1 id = "kor">Инсулинова резистентност <Link1 href="/theory#terter" text="(ИР)"> </Link1></Heading1>
        Инсулиновата резистентност (ИР) е състояние, при което клетките в организма стават по-малко отзивчиви на действието на инсулин,
        хормонът, който регулира нивата на глюкоза в кръвта. При ИР, клетките имат затруднено усвояване на глюкоза от кръвта,
        въпреки че в кръвта има достатъчно инсулин. Като отговор на това, панкреасът, органът, който произвежда инсулин, често се старае
        да компенсира с увеличаване на производството на инсулин, за да поддържа нормалните нива на глюкоза.
        При ИР, клетките в мускулите, мастните тъкани и черния дроб (жлъчката) постепенно загубват своята способност да реагират 
        адекватно на инсулин. Това води до високи нива на глюкоза в кръвта (хипергликемия), което може да има негативни последствия за здравето.

        <Heading1 id = "pot">Причини за инсулинова резистентност</Heading1>
        <span className="font-medium">Причините за инсулиновата резистентност включват:</span>
        <br></br>
        <span className="font-medium">Генетика:</span> Някои генетични фактори могат да предразположат към <Link1 href="/theory#kor" text="ИР"> </Link1>. 
        Наличието на определени генетични вариации може да повлияе на функцията на клетките и тъканите, които реагират на инсулина.
        <br></br>
        <span className="font-medium">Метаболичен дисбаланс:</span> Наднорменото тегло, особено в областта на корема, са свързани с висок риск от 
        <Link1 href="/theory#kor" text="ИР"> </Link1>.
        <br></br>
        <span className="font-medium">Физическа неактивност:</span> Липсата на физическа активност и седентарният начин на живот могат да допринесат за развитието на 
        <Link1 href="/theory#kor" text="ИР"> </Link1>.
        <br></br>
        <span className="font-medium">Хронични възпаления:</span> Хроничните възпаления повишават нивата на стресови хормони, както и инсулина
        <br></br>
        <span className="font-medium">Възраст и пол:</span> Рискът се увеличава с възрастта и е по-честа при мъжете. Жените могат да имат по-голяма вероятност 
        да развият <Link1 href="/theory#kor" text="ИР"> </Link1> по време на бременността (гестационна инсулинова резистентност).
        <br></br>
        <span className="font-medium">Хормонални фактори:</span> Различни хормонални промени могат да повлияят на инсулиновата чувствителност. Например, някои хормонални нарушения 
        като полицистичния синдром на яйчниците (PCOS) или акромегалията (излишен растеж на ръцете, краката и лицето) са свързани с <Link1 href="/theory#kor" text="ИР"> </Link1>.
        <br></br>
        <span className="font-medium">Стрес:</span>  Хроничният стрес може да повлияе на регулацията на кръвната захар и да доведе до 
        <Link1 href="/theory#kor" text="ИР"> </Link1>.
        <br></br>
        <span className="font-medium">Липса на сън:</span> Недостатъчният или нарушеният сън може да бъде свързан с повишаване на риска от <Link1 href="/theory#kor" text="ИР"> </Link1>.
        <br></br>
        <span className="font-medium">Хранителни фактори:</span> Високо потребление на рафинирани въглехидрати, захари и наситени мазнини, както и
        някои диети с високо съдържание на фруктоза също са свързани с <Link1 href="/theory#kor" text="ИР"> </Link1>.
        <br></br>
        <span className="font-medium">Лекарства:</span> Някои лекарства, като глюкокортикостероидите, антиретровирусни лекарства, бета-блокери и други, могат да 
        влошат инсулиновата чувствителност.
        <br></br>
        Инсулиновата резистентност е сложно състояние, което включва взаимодействието на различни фактори. 
        В повечето случаи комбинацията от генетика, жизнен стил, наднормено тегло, физическа неактивност и околната среда може да бъде 
        доведе до нея.

     
      </div>
    </main>
  )
}
