import { Heading1, Link1 } from "../../../componentz/TextComponents";

const FaqItem = ({ q, a }) => {
  return (
    <>
      <p className="">
        <div className="font-mono font-bold"> {q} </div>
        {a}
      </p>
      <br></br>
    </>
  );
}

export default function Page() {
  return (
    <main className="flex min-h-screen flex-col items-center">
      <div className=" justify-between p-8 max-w-5xl justify-center">
        <FaqItem id="я3" q="Каква е връзката между ИР, Тиреоидит на Хашиморо и Хипофункция на щитовидна жлеза?"
          a="Някои наблюдения показват връзка между ИР и повишен риск от хипотиреоидизъм. Инсулинът може да повлияе на обратната конверсия на тироксин (T4)
          към трийодтиронин (T3) в периферните тъкани, което може да повлияе на общата функция на щитовидната жлеза.
          Въпреки че не се смята, че ИР директно причинява Хашимото, има някои изследвания, които са намерили свързаност между метаболитния синдром 
          (който включва инсулинова резистентност) и развитието на аутоимунни заболявания, включително Хашимото. Въпреки това, точните връзки и 
          механизми не са напълно разбрани и се изискват допълнителни изследвания в тази област.
          "/>

        <FaqItem id="w1" q="Възмжно ли е изследването за инсулин да покаже фалшиви ниски резултати?" a="Да, ако има наличие на влошено здраве на червените 
          кръвни телца. Високите нива на мазнини (триглицериди) в кръвта, наричани липемия, могат да доведат до ниски резултати на измерването на инсулин. "/>

        <FaqItem q="Кои витамини подобряват Инсулиновата чувствителност?" a="Всички витамини са важни, но витамин Д доказано подобрява Инсулиновата чувствителност. 
          Дори има твърдения, че пречи на развитието на диабет тип 2." />



        <Heading1 id="kor">Каква е връзката между <Link1 href="/theory#terter" text="ИР"> </Link1>, Тиреоидит на Хашиморо и Хипофункция на щитовидна жлеза?</Heading1>
        Някои наблюдения показват връзка между ИР и повишен риск от хипотиреоидизъм. Инсулинът може да повлияе на обратната конверсия на тироксин (T4)
        към трийодтиронин (T3) в периферните тъкани, което може да повлияе на общата функция на щитовидната жлеза.
        Въпреки че не се смята, че ИР директно причинява Хашимото, има някои изследвания, които са намерили свързаност между метаболитния синдром
        (който включва инсулинова резистентност) и развитието на аутоимунни заболявания, включително Хашимото. Въпреки това, точните връзки и
        механизми не са напълно разбрани и се изискват допълнителни изследвания в тази област.
      </div>
    </main>
  )
}
