import { Heading1, Link1 } from "../../../componentz/TextComponents";

const FaqItem = ({ q, a }) => {
  return (
    <>
      <p className="">
        <div className="font-mono font-bold"> {q} </div>
        {a}
      </p>
      <br></br>
    </>
  );
}

export default function Page() {
  return (
    <main className="flex min-h-screen flex-col items-center">
      <div className=" justify-between p-8 max-w-5xl justify-center">
        <Heading1 id="122">Каква е връзката между <Link1 href="/theory#kor" text="ИР"> </Link1>, Тиреоидит на Хашиморо и Хипофункция на щитовидна жлеза?</Heading1>
        Някои наблюдения показват връзка между ИР и повишен риск от хипотиреоидизъм. Инсулинът може да повлияе на обратната конверсия на тироксин (T4)
        към трийодтиронин (T3) в периферните тъкани, което може да повлияе на общата функция на щитовидната жлеза.
        Въпреки че не се смята, че ИР директно причинява Хашимото, има някои изследвания, които са намерили свързаност между метаболитния синдром
        (който включва инсулинова резистентност) и развитието на аутоимунни заболявания, включително Хашимото. Въпреки това, точните връзки и
        механизми не са напълно разбрани.
        <br></br>
        <Heading1 id="4234">Кои витамини подобряват Инсулиновата чувствителност?</Heading1>
        Въпреки че витамините самостоятелно не могат да заместят медицинското лечение, те могат да подпомогнат в поддържането на здравословни нива на глюкоза 
        в кръвта и подобряване на общото здраве. Ето някои от витамините и хранителните вещества, които се свързват с подобряване на инсулиновата чувствителност:
        <br></br>
        <span className="font-medium">Витамин D:</span> Има изследвания, които показват, че ниските нива на витамин D са свързани с намалена инсулинова 
        чувствителност. Приемането на витамин D може да помогне за подобряване на инсулиновата реакция в тялото. Добри източници на витамин D включват риба, 
        яйца, обогатено мляко и излагане на слънце.
        <br></br>
        <span className="font-medium">Хром:</span> Хромът е минерал, който играе важна роля в обработката на глюкоза. Той може да подобри инсулиновата 
        чувствителност и контрола на нивата на кръвната захар. Хромът е наличен в храни като пълнозърнести продукти, яйца, ябълки и броколи.
        <br></br>
        <span className="font-medium">Омега-3 мастни киселини:</span> Омега-3 мастните киселини в рибата, ленено семе и авокадо, могат да помогнат за 
        намаляване на възпалението в тялото и подобряване на инсулиновата чувствителност.
        <br></br>
        <span className="font-medium">Магнезий:</span>Магнезият е минерал, който е важен за много биохимични процеси в организма, включително за обработката 
        на глюкоза. Ниските нива на магнезий са свързани с намалена инсулинова чувствителност. Добри източници на магнезий са зеленчуци, ядки, семена.

        <Heading1 id="424">Възмжни ли са фалшиви ниски нива на инсулин при кръвна проба?</Heading1>
        Да, възможно е изследването за инсулин да покаже фалшиви ниски резултати когато:
        <br></br>
        <span className="font-medium">Взаимодействие с антитела:</span>Някои хора имат в кръвта си антитела, които могат да реагират с инсулина в пробата за изследване. 
        <br></br>
        <span className="font-medium">Липемия:</span>, състояние, при което има прекомерно ниво на мазнини (липиди) в кръвта. 
        <br></br>
        <span className="font-medium">Физиологични фактори:</span> например висока физическа активност или хипогликемия в момента на кръвопробата (неправилен тест).
        <br></br>
        <span className="font-medium">Брой еритроцити:</span> повишен или намален брой червени кръвни телца (еритроцити) може да доведе до интерференции в  
        методите за измерване. Тъй като изследванията се извършват в плазма или серум, проблеми с броя на еритроцитите могат да доведат до неточни резултати.


      </div>
    </main>
  )
}
